In [30]:
import pandas as pd 
df=pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [31]:
X=df.iloc[:,:-1]
y=df.iloc[:,3]

In [32]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [33]:
X

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [34]:
#to covert the labels in categorical form we use label encoding
from sklearn.preprocessing import LabelEncoder

In [35]:
le_comapany=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [36]:
X["comapny_n"]=le_comapany.fit_transform(X["company"])
X["job_n"]=le_comapany.fit_transform(X["job"])
X["degree_n"]=le_comapany.fit_transform(X["degree"])

In [37]:
X=X.drop(["company","job","degree"],axis=1)

In [38]:
X

    comapny_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [41]:
from sklearn import tree

In [42]:
model=tree.DecisionTreeClassifier()

In [43]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [44]:
model.score(X_test,y_test)

0.5

In [46]:
model.predict([[2,2,0]])

array([0], dtype=int64)